#ifndef _DATA_STRUCTURE_H_
#define _DATA_STRUCTURE_H_


/*****************************************单向链表,队列存放*******************************************/




/***********************宏定义********************/

#define QUE_IS_EMPTY -1

/***********************类型定义********************/


struct Queue
{
	struct Queue * Node;
	int pos;
};

//类型：结构体内部的内容类型




/***********************接口声明********************/


//功能：释放所有链表
void free_queue();
//功能：进队列,添加一个结构体到链表尾,需要参数链表尾节点
struct Queue * in_queue();
//功能：出队列获得表头的内容,删除表头
int de_queue();
//获得头指针
struct Queue * get_queue_head();
//获得尾指针
struct Queue * get_queue_tail();
//判断是否为空
int is_queue_empty();
//判断是否已满
int is_queue_full();


/*****************************************单向链表,栈存放*******************************************/



#endif
